tests/com/l7tech/service/resources/dotNetSCTRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsa:Action wsu:Id="Id-8a5bd749-0c41-42d7-bdbe-1630eca89e3f">http://schemas.xmlsoap.org/ws/2004/04/security/trust/RST/SCT</wsa:Action>
        <wsa:MessageID wsu:Id="Id-96a8f895-3bfe-4e57-9aa1-2f2194c8ff6e">uuid:e4cc4af4-9e69-4a38-aafb-0e7c1278208d</wsa:MessageID>
        <wsa:ReplyTo wsu:Id="Id-f95f24b0-0a39-43b8-a38f-4c75565d2517">
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsa:To wsu:Id="Id-cb9408d3-2f91-4e95-88f0-302521361b45">http://localhost:8081/ssg/soap</wsa:To>
        <wsse:Security soap:mustUnderstand="1">
            <wsu:Timestamp wsu:Id="Timestamp-b62ccace-9124-43fd-a82a-6fbdb9c89f17">
                <wsu:Created>2004-06-28T22:15:33Z</wsu:Created>
                <wsu:Expires>2004-06-28T22:20:33Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-b6a6c168-750f-4b45-af39-8253c4d04feb">
                <wsse:Username>fpang</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">1ToyYDyGVRIlpLpB7TsRzl5cqhE=</wsse:Password>
                <wsse:Nonce>H5UAhqvkBmNdl7Hj1hs8xw==</wsse:Nonce>
                <wsu:Created>2004-06-28T22:15:33Z</wsu:Created>
            </wsse:UsernameToken>
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/>
                    <Reference URI="#Id-8a5bd749-0c41-42d7-bdbe-1630eca89e3f">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>yjNjA6Wead6kNEYe7nC6rW3fuhU=</DigestValue>
                    </Reference>
                    <Reference URI="#Id-96a8f895-3bfe-4e57-9aa1-2f2194c8ff6e">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>e+CRcNxXG0EDkYtw+zPJ87OwVBU=</DigestValue>
                    </Reference>
                    <Reference URI="#Id-f95f24b0-0a39-43b8-a38f-4c75565d2517">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>10sP9D0/Y0hk2I8tcBOSZyJEijo=</DigestValue>
                    </Reference>
                    <Reference URI="#Id-cb9408d3-2f91-4e95-88f0-302521361b45">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>5gc3WHkEDSkPLRyiaF8uqSo72hI=</DigestValue>
                    </Reference>
                    <Reference URI="#Timestamp-b62ccace-9124-43fd-a82a-6fbdb9c89f17">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>ZqYma12j7ZmITmR2FFQNmy2LTq8=</DigestValue>
                    </Reference>
                    <Reference URI="#Id-9ea400b4-602b-441c-88c2-de349ddba642">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>HxqP8B6c21YsTYfM54Tcap8HcN8=</DigestValue>
                    </Reference>
                </SignedInfo>
                <SignatureValue>Bklb5c1osP+MQv67Sc/XZDieuZE=</SignatureValue>
                <KeyInfo>
                    <wsse:SecurityTokenReference>
                        <wsse:Reference URI="#SecurityToken-b6a6c168-750f-4b45-af39-8253c4d04feb" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#UsernameToken"/>
                    </wsse:SecurityTokenReference>
                </KeyInfo>
            </Signature>
        </wsse:Security>
    </soap:Header>
    <soap:Body wsu:Id="Id-9ea400b4-602b-441c-88c2-de349ddba642">
        <wst:RequestSecurityToken xmlns:wst="http://schemas.xmlsoap.org/ws/2004/04/trust">
            <wst:TokenType>http://schemas.xmlsoap.org/ws/2004/04/security/sc/sct</wst:TokenType>
            <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
            <wst:Base>
                <wsse:SecurityTokenReference>
                    <wsse:Reference URI="#SecurityToken-b6a6c168-750f-4b45-af39-8253c4d04feb" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#UsernameToken"/>
                </wsse:SecurityTokenReference>
            </wst:Base>
            <wst:Entropy>
                <xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
                    <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
                    <KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
                        <wsse:SecurityTokenReference>
                            <wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">dWL8/RdVQ0T3fMHHTAP/zSSRPvA=</wsse:KeyIdentifier>
                        </wsse:SecurityTokenReference>
                    </KeyInfo>
                    <xenc:CipherData>
                        <xenc:CipherValue>cGF35ICchXkdyhYOaNxk+z2jhgqaDJM7IRfChwmZ4GtG30wpvZjwjHnqWFJURUgSlC05yXi6k7YXgYvY2K/QwJEYkRy6ZznklHjqOfzbv9Cmsd5e7bmM9wfAB+r2DSXcIUKR3yUU4JCKo69O/Qhm3FbwUZokIQ72EYEQxemW8qs=</xenc:CipherValue>
                    </xenc:CipherData>
                    <xenc:CarriedKeyName>SecurityToken-06cd8e58-a1de-48a4-81cf-3975c3a00e63</xenc:CarriedKeyName>
                </xenc:EncryptedKey>
            </wst:Entropy>
            <wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2002/12/policy">
                <wsa:EndpointReference>
                    <wsa:Address>http://localhost:8081/ssg/soap</wsa:Address>
                </wsa:EndpointReference>
            </wsp:AppliesTo>
            <wst:LifeTime>
                <wsu:Expires>2004-06-29T02:15:33Z</wsu:Expires>
            </wst:LifeTime>
        </wst:RequestSecurityToken>
    </soap:Body>
</soap:Envelope>
